---
kind: property
id: P:Autodesk.Revit.DB.ColorOptions.BackgroundColor
source: html/d6713e11-6527-18c4-2478-3a24c0c4c431.htm
---
# Autodesk.Revit.DB.ColorOptions.BackgroundColor Property

The background color of the current canvas theme applied to views.

## Syntax (C#)
```csharp
public Color BackgroundColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null